## Plan Result (prod-video-hearings)




<pre><code>Plan: 11 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.enterprise.azurerm_management_group.level_1[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azuread_group.contributors[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azuread_group.owners[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azuread_group.readers[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_admins[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azuread_group.security_readers[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.contributors[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.owners[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.readers[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_admins[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers[&#34;HMCTS&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.enterprise.azurerm_management_group.level_1["HMCTS"] will be created
  + resource "azurerm_management_group" "level_1" {
      + display_name               = "HMCTS"
      + id                         = (known after apply)
      + name                       = "HMCTS"
      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/fb6e0e22-0da3-4c35-972a-9d61eb256508"
      + subscription_ids           = (known after apply)
    }

  # module.enterprise.module.bootstrap.azuread_group.contributors["HMCTS"] will be created
  + resource "azuread_group" "contributors" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Contributors (mg:HMCTS)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.enterprise.module.bootstrap.azuread_group.owners["HMCTS"] will be created
  + resource "azuread_group" "owners" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Owners (mg:HMCTS)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.enterprise.module.bootstrap.azuread_group.readers["HMCTS"] will be created
  + resource "azuread_group" "readers" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Readers (mg:HMCTS)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.enterprise.module.bootstrap.azuread_group.security_admins["HMCTS"] will be created
  + resource "azuread_group" "security_admins" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Security Admins (mg:HMCTS)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.enterprise.module.bootstrap.azuread_group.security_readers["HMCTS"] will be created
  + resource "azuread_group" "security_readers" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS Security Readers (mg:HMCTS)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.contributors["HMCTS"] will be created
  + resource "azurerm_role_assignment" "contributors" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/providers/Microsoft.Management/managementGroups/HMCTS"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.owners["HMCTS"] will be created
  + resource "azurerm_role_assignment" "owners" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/providers/Microsoft.Management/managementGroups/HMCTS"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.readers["HMCTS"] will be created
  + resource "azurerm_role_assignment" "readers" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/HMCTS"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.security_admins["HMCTS"] will be created
  + resource "azurerm_role_assignment" "security_admins" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Admin"
      + scope                            = "/providers/Microsoft.Management/managementGroups/HMCTS"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.security_readers["HMCTS"] will be created
  + resource "azurerm_role_assignment" "security_readers" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/HMCTS"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 11 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":23,"Program":"tfcmt","SHA1":"","Target":"prod-video-hearings","Vars":{}} -->